(package! smooth-scroll)

(package! beacon)

(package! vlf)
;; (package! vlf :recipe (:host github :repo "m00natic/vlfi" :files ("*.el"))
;;   :pin "cc02f2533782d6b9b628cec7e2dcf25b2d05a27c" :disable t)

(package! yasnippet-snippets)

(package! org-alert)

(package! org-super-agenda)

(package! org-roam-ui)

(package! org-modern)

(package! org-jira)

(package! org-auto-tangle :recipe (:host github :repo "yilkalargaw/org-auto-tangle" :files ("*.el")))

(package! el-secretario)
(package! el-secretario-org)
(package! el-secretario-mu4e)

(package! ox-confluence :recipe (:host github :repo "nan0scho1ar/ox-confluence-modern" :files ("*.el")))

(package! org-transclusion)

(package! sqleye :recipe (:host github :repo "nan0scho1ar/sqleye" :files ("*.el")))

(package! gitmanager :recipe (:local-repo "~/repos/me/gitmanager" :build (:not compile)))

(package! ansi-exec :recipe (:host github :repo "nan0scho1ar/emacs-ansi-exec" :files ("*.el")))
(package! ahoy :recipe (:host github :repo "nan0scho1ar/emacs-ahoy" :files ("*.el")))

(package! websocket)

(package! simple-httpd)

(package! f)
